# Αρχικοποίηση λιστών
LI = ["α", "δ", "γ", "β", "δ", "γ", "β", "α", "δ", "γ", "β", "δ", "γ", "β", "α"]
ON = []
SV = []

# Δ1 για κάθε έναν από τους 20 υποψηφίους διαβάζουμε όνομα και 15 απαντήσεις
for i in range(20):
    x = raw_input("Δώστε όνομα: ")
    ON.append(x)
    sum = 0

    for j in range(15):
        print "Δώστε την ", j+1, " απάντηση"
        ap = raw_input()
        while ap != "α" and ap != "β" and ap != "γ" and ap != "δ" and ap != "ε":
            print "Δώστε την ", j+1, " απάντηση"
            ap = raw_input()
        # Υπολογισμός βαθμολογίας του υποψηφίου
        if LI[j] == ap:
            sum = sum + 3
        elif ap!= "ε":
            sum = sum - 1
    SV.append(sum)

# Δ2 Εμφάνιση ονομάτων υποψηφίων που είχαν βαθμολογία μεγαλύτερη ή ίση του ΜΟ
sum = 0.0
for x in SV:
    sum = sum + x
mo = sum/20
print "Οι υποψήφιοι που ξεπέρασαν τον μέσο όρο της συνολικής βαθμολογίας είναι: "
for i in range(20):
    if SV[i] >= mo:
        print ON[i]

# Δ3 Εμφάνιση των 3 ονομάτων με τηην υψηλότερη βαθμολογία
# Ταξινόμηση Φυσσαλίδας
for i in range(len(SV)-1):
    for j in range (len(SV)-1, i, -1):
        if SV[j] > SV[j-1]:
            SV[j], SV[j-1] = SV[j-1], SV[j]
            ON[j], ON[j-1] = ON[j-1], ON[j]
print "Οι υποψήφιοι με τις 3 υψηλότερες βαθμολογίες ήταν:"
print ON[0], ON[1], ON[2]
