# ΘΕΜΑ ∆  2019
# Σε μία αποθήκη σταθμού τρένων υπάρχει ένας πεπερασμένος αριθμός από κιβώτια εμπορευμάτων. 
# Τα κιβώτια πρόκειται να φορτωθούν σε άδεια βαγόνια ενός τρένου. Κάθε βαγόνι έχει όριο
# χωρητικότητας 2000 λίτρα. Η φόρτωση ακολουθεί την παρακάτω διαδικασία: 
# Σε κάθε βαγόνι φορτώνονται διαδοχικά κιβώτια με προκαθορισμένη σειρά, μέχρι να συμπληρωθεί
# το όριο χωρητικότητάς του. Ένα κιβώτιο φορτώνεται στο βαγόνι μόνο εάν ο όγκος του μαζί με
# τον όγκο των ήδη φορτωμένων κιβωτίων δεν ξεπερνούν το όριο χωρητικότητας του βαγονιού. 
# ∆ιαφορετικά η φόρτωση του βαγονιού ολοκληρώνεται και το κιβώτιο φορτώνεται στο επόμενο βαγόνι.
# Αν δεν υπάρχει άλλο διαθέσιμο βαγόνι, το κιβώτιο παραμένει στην αποθήκη.  
# Η παραπάνω διαδικασία επαναλαμβάνεται μέχρι να τελειώσουν τα κιβώτια ή να μην υπάρχει άλλο 
# διαθέσιμο βαγόνι. 
# Να αναπτύξετε πρόγραμμα σε γλώσσα προγραμματισμού Python, το οποίο: 
# ∆1. α.  Να διαβάζει τον αριθμό των διαθέσιμων βαγονιών του τρένου. (μον. 1) 
#     β. Να διαβάζει τον όγκο κάθε κιβωτίου της αποθήκης σε λίτρα και να το εισάγει σε μία 
#        λίστα με όνομα QUE, έως ότου εισαχθεί ως όγκος κιβωτίου ο αριθμός μηδέν (0). (μον. 4) 
#                                                                                       Μονάδες 5 
# ∆2. Να υπολογίζει (μον. 4) και να εμφανίζει (μον. 4), με κατάλληλο μήνυμα, για κάθε βαγόνι που
#     χρησιμοποιήθηκε, το πλήθος και τον συνολικό όγκο των κιβωτίων που περιέχει. Κάθε κιβώτιο 
#     που φορτώνεται αφαιρείται από τη λίστα (μον. 2)                                   Μονάδες 10 
# ∆3. Να υπολογίζει τον αριθμό των βαγονιών που χρησιμοποιήθηκαν. (μον. 2) Αν φορτώθηκαν όλα τα
#     κιβώτια, να υπολογίζει το συνολικό όγκο τους (μον. 2) και να εμφανίζει με κατάλληλο μήνυμα, 
#     τον αριθμό των βαγονιών που χρησιμοποιήθηκαν και τον συνολικό όγκο. (μον. 2) ∆ιαφορετικά, 
#     αν δεν φορτώθηκαν όλα, να υπολογίζει και να εμφανίζει το πλήθος των κιβωτίων που παρέμειναν
#     στη λίστα (αποθήκη)  καθώς και τον συνολικό όγκο σε όλα τα βαγόνια που δεν αξιοποιήθηκε. (μον. 4)  
#     Θεωρείστε ότι κανένα κιβώτιο δεν έχει όγκο μεγαλύτερο από 2.000 λίτρα             Μονάδες 10


n = int(input("Δώστε αριθμό βαγονιών: "))
QUE = []
v = input("Δώστε όγκο κιβωτίου: ")
while v != 0:
    QUE.append(v)
    v = input("Δώστε όγκο κιβωτίου: ")

w = [0] # όγκος κιβωτίων κάθε βαγονιού
while len(QUE) != 0 and len(w) <= n:
    count = 0 # πλήθος κιβωτίων στο τρέχων βαγόνι
    while len(QUE) != 0 and w[-1] + QUE[0] <= 2000:
        count = count + 1
        x = QUE.pop(0)
        w[-1] = w[-1] + x
    print "Φορτώθηκαν ", count, " κιβώτια με όγκο: ", w[-1]
    w.append(0)
w.pop()

sum = 0
for x in w:
    sum = sum + x

if len(QUE) == 0:
    print "Χρησιμοποιήθηκαν ", len(w), " βαγόνια"
    print "Φορτώθηκαν συνολικά ", sum, " lt"
else:
    print "Παρέμειναν ", len(QUE), " κιβώτια στην αποθήκη"
    print "Δεν αξιοποιήθηκαν ", 2000*n-sum, " lt στα βαγόνια"
