# ΘΕΜΑ ∆  2021
#Στο πλαίσιο των εκδηλώσεων για τον εορτασμό των 200 χρόνων από την Ελληνική Επανάσταση, πραγματοποιείται
# διαγωνισμός παραδοσιακών χορών στον οποίο συμμετέχουν 100 ομάδες από διάφορα μέρη της Ελλάδας. Η βαθμολογία
# των ομάδων κυμαίνεται από 1 έως 200 ακέραιες μονάδες. Στην επόμενη φάση του διαγωνισμού προκρίνονται οι
# ομάδες που συγκέντρωσαν βαθμολογία μεγαλύτερη του 150. 
# Να αναπτύξετε πρόγραμμα σε γλώσσα προγραμματισμού Python το οποίο να πραγματοποιεί τα παρακάτω: 
# ∆1. Να διαβάζει το όνομα κάθε ομάδας χορού και τη βαθμολογία της. Τα στοιχεία αυτά καταχωρίζονται στις λίστες
#     OMADES και BATHMOI αντίστοιχα.                                                                  Μονάδες 4 
# ∆2. Να δημιουργεί τις λίστες PROK και BATHPROK με τα ονόματα και τις βαθμολογίες των ομάδων αντίστοιχα, που
#     έχουν προκριθεί στην επόμενη φάση. Θεωρήστε ότι θα προκριθεί τουλάχιστον μία ομάδα στην επόμενη φάση. 
#                                                                                                     Μονάδες 6
# ∆3. Να ταξινομεί τη λίστα BATHPROK με χρήση του αλγορίθμου ταξινόμησης ευθείας ανταλλαγής (φυσαλίδα - bubblesort)
#     σε φθίνουσα σειρά ως προς τις βαθμολογίες αναδιατάσσοντας συγχρόνως τη λίστα PROK, έτσι ώστε να διατηρείται
#     η αντιστοιχία ομάδων – βαθμολογιών. Σε περίπτωση ισοβαθμίας να γίνεται ταξινόμηση με αλφαβητική σειρά ως προς
#     τα ονόματα της λίστας PROK.                                                                     Μονάδες 10 
# ∆4. Να υπολογίζει και να εμφανίζει το πλήθος των ομάδων που ισοβαθμούν στην πρώτη θέση της λίστας BATHPROK.  
#                                                                                                     Μονάδες 5 
# Σημείωση:  ∆εν απαιτούνται έλεγχοι ορθότητας δεδομένων.  

OMADES = []
BATHMOI = []
for i in range(100):
    om = raq_input("Δώστε όνομα ομάδας")
    b = int(input("Δώστε βαθμολογία 1 - 100")
    OMADES.append(om)
    BATHMOI.append(b)

#Δημιουργία λιστών με τα στοιχεία των ομάδων που προκρίνονται στην επόμενη φάση
PROK = []
BATHPROK= []
for i in range(100):
    if BATHMOI[i] > 150:
        PROK.append(OMADES[i])
        BATHPROK.append(BATHMOI[i])

# Ταξινόμηση τω προκριθέντων σε φθίνουσα σειρά κατά θαθμολογία και
# σε περίπτωση ισοβαθμίας αλφαβητικά κατά όνομα
for i in rage(len(PROK)-1):
    for j in range(len(PROK)-1, i, -1):
        if BATHPROK[j] > BATHPROK[j-1]:
            BATHPROK[j], BATHPROK[j-1] = BATHPROK[j-1], BATHPROK[j]
            PROK[j], PROK[j-1] = PROK[j-1], PROK[j]
        elif PROK[j] < prok[j-1]:
            PROK[j], PROK[j-1] = PROK[j-1], PROK[j]

# Πλήθος ισοβαθμιών στην πρώτη θέση
count = 0
while count < len(PROK) and BATHPROK[count] = BATHPROK[1]:
    count = count + 1
print count, "ισοβαθμίες στην 1η θέση"
