# ΘΕΜΑ Γ  2020
# Σε μία παράσταση υπαίθριου δημοτικού θεάτρου το εισιτήριο εισόδου είναι για τους ενήλικες δέκα (10) ευρώ
# και για τα παιδιά πέντε (5) ευρώ. Η χωρητικότητα του θεάτρου είναι πεντακόσια (500) άτομα. 
# Να αναπτύξετε πρόγραμμα σε γλώσσα προγραμματισμού Python, το οποίο να πραγματοποιεί τα παρακάτω: 
# Γ1. α)  Για κάθε άτομο ή παρέα εισερχόμενων θεατών, να εμφανίζει τις διαθέσιμες ελεύθερες θέσεις του
#         θεάτρου και να διαβάζει από το πληκτρολόγιο το πλήθος των ενηλίκων και ακολούθως το πλήθος των
#         παιδιών της παρέας (μον. 6). 
#     β)  Να καλεί τη συνάρτηση EISITIRIO(), η οποία υπολογίζει το συνολικό κόστος των εισιτηρίων, και στη
#         συνέχεια το πρόγραμμα να εμφανίζει το κόστος αυτό. Η λειτουργία της συνάρτησης αυτής περιγράφεται
#         στο ερώτημα Γ3 (μον. 3). 
#     γ)  Η διαδικασία της εισόδου θεατών να τερματίζεται, όταν εισαχθεί ο αριθμός μείον ένα (-1) ως πλήθος
#         ενηλίκων θεατών μιας παρέας. Ο αριθμός μείον ένα (-1) σημαίνει ότι είτε οι διαθέσιμες θέσεις δεν
#         επαρκούν είτε δεν υπάρχουν άλλοι θεατές που επιθυμούν να εισέλθουν. Στην περίπτωση αυτή, δεν
#         εισάγεται αριθμός παιδιών. (μον. 5) 
#     Θεωρήστε ότι υπάρχει τουλάχιστον ένας θεατής και σε κάθε παρέα υπάρχει τουλάχιστον ένας ενήλικας. 
#                                                                                                   Μονάδες 14
# Γ2. Να υπολογίζει και να εμφανίζει:
#     α)  Τα συνολικά έσοδα του θεάτρου (μον. 2). 
#     β)  Το ποσοστό των παιδιών στο σύνολο των θεατών (μον. 3).
#                                                                                                   Μονάδες 5 
# Γ3. Να υλοποιήσετε τη συνάρτηση EISITIRIO(), η οποία δέχεται το πλήθος των ενηλίκων και το πλήθος των
#     παιδιών μιας παρέας και επιστρέφει το συνολικό κόστος των εισιτηρίων.                         Μονάδες 6



def EISITIRIO(e,p):
    kostos = e*10 + p*5
    return kostos

sum = 0
countp = 0
count = 0
print "Διαθέσιμες θέσεις:", 500 - count
en = int(input("Δώστε πλήθος ενηλίκων: "))
while en != -1:
    pai = int(input("Δώστε πλήθος παιδιών: "))
    poso = EISITIRIO(en, pai)
    print "Ωφείλετε: ", poso
    sum = sum + poso
    count = count + en + pai
    countp = countp + pai
    print "Διαθέσιμες θέσεις:", 500 - count
    en = int(input("Δώστε πλήθος ενηλίκων: "))
print "Συνολικά έσοδα: ", sum
pos = countp*100.0/count
print "Ποσοστό παιδιών: ", pos, "%"
