# -*- coding: utf-8 -*-
# Στις εξετάσεις του Κρατικού Πιστοποιητικού Γλωσσομάθειας συμμετέχουν υποψήφιοι από όλη τη χώρα. Η βαθμολογία των υποψηφίων είναι ένας 
# ακέραιος αριθμός από το 1 έως και το 100. Επιτυχών θεωρείται ο υποψήφιος που έχει βαθμολογία πάνω από 60.
# Θεωρήστε ότι υπάρχουν περισσότεροι από δύο υποψήφιοι και τουλάχιστον ένας επιτυχών.
# Να γράψετε πρόγραμμα σε γλώσσα προγραμματισμού Python το οποίο:
# Δ1. Για κάθε υποψήφιο:
#     α) Να διαβάζει τον κωδικό του (ως συμβολοσειρά) και να τον καταχωρίζει σε λίστα με όνομα KΟD (μον.3).
#     β) Να διαβάζει τη βαθμολογία του και να κάνει έλεγχο ορθότητας τιμών. Στη συνέχεια να την καταχωρίζει σε λίστα με όνομα VATH (μον.4).
#     Η εισαγωγή των στοιχείων θα τερματίζεται, όταν δοθεί ως κωδικός υποψηφίου η λέξη “ΤΕΛΟΣ”. Μονάδες 7
# Δ2. Να υπολογίζει και να εμφανίζει τον μέσο όρο της βαθμολογίας όλων των υποψηφίων. Μονάδες 4
# Δ3. α) Να εντοπίζει τη μεγαλύτερη βαθμολογία των υποψηφίων (μον.3).
#     β) Να εμφανίζει τους κωδικούς των υποψηφίων που έχουν αυτή τη βαθμολογία (μον.3). Μονάδες 6
# Δ4. Να δημιουργεί αρχείο κειμένου με όνομα “epityxon.txt”, όπου σε κάθε γραμμή του θα γραφεί ο αύξων αριθμός γραμμής, ακολουθούμενος από 
#     τελεία, και ο κωδικός του επιτυχόντος υποψηφίου. Το αρχείο να έχει την παρακάτω δομή (ενδεικτικά):
#           1.ΑΚ12345
#           2.ΒΤ45678               Μονάδες 8

KOD = []
VATH = []

kodikos = raw_input('Δώστε κωδικό υποψηφίου ή ΤΕΛΟΣ')
while kodikos != 'ΤΕΛΟΣ':
    KOD.append(kodikos)
    vathmos = int(input('Δώστε βαθμολογία - 1 έως και 100'))
    while vathmos < 1 or vathmos > 100:
        vathmos = int(input('Δώστε βαθμολογία - 1 έως και 100'))
    VATH.append(vathmos)

if len(VATH) > 0:
    athr = 0
    for v in VATH:
        athr += v
    avrg = athr / len(VATH)
    print 'Μέσος όρος βαθμολογίας: ', avrg

    max_v = -1
    for i in range(len(VATH)):
        if VATH[i] > max_v:
            max_v = VATH[i]

    for i in range(len(VATH)):
        if VATH[i] == max_v:
            print KOD[i]

    if max_v > 60:
        f = open('epityxon.txt', 'r')
        aa = 0
        for i in range(len(VATH)):
            if VATH[i] > 60:
                aa += 1
                f.write(str(a)+'.'+KOD[i]+'\n')
        f.close()
    else:
        print 'Δεν υπήρχαν επιτυχόντες'
else:
    print 'Δεν δόθηκαν στοιχεία υποψηφίων'
