# ΘΕΜΑ Γ  Επαναληπτικές 2021
# Ένας φοιτητής θέλει να αγοράσει ένα ηλεκτρικό ποδήλατο αξίας 1200 ευρώ. Για τον σκοπό αυτό αποφάσισε να εργαστεί στην οικογενειακή επιχείρηση
# ως σερβιτόρος και να αποταμιεύσει τα χρήματα από τα φιλοδωρήματα. 
# Να αναπτύξετε πρόγραμμα σε γλώσσα προγραμματισμού Python, το οποίο να πραγματοποιεί τα παρακάτω: 
# Γ1. Να διαβάζει κάθε μέρα, στο τέλος της βάρδιας, το ημερήσιο ποσό των φιλοδωρημάτων μέχρι το συνολικό ποσό αποταμίευσης από τα φιλοδωρήματα,
#     να γίνει ίσο ή μεγαλύτερο από τα 1200 ευρώ. Θεωρήστε ότι δεν υπάρχει ημέρα χωρίς φιλοδώρημα.                       Μονάδες 12 
# Γ2. Να υπολογίζει και να εμφανίζει το πλήθος των ημερών που χρειάστηκε για τον σκοπό αυτό.                             Μονάδες 3 
# Γ3. Να υπολογίζει και να εμφανίζει το ποσοστό των ημερών που το ημερήσιο ποσό των φιλοδωρημάτων ξεπέρασε τα 20 ευρώ.   Μονάδες 5  
# Γ4. Να υπολογίζει και να εμφανίζει πιθανό περίσσευμα χρημάτων. Στη συνέχεια να εμφανίζει κατάλληλο μήνυμα, αν το περίσσευμα επαρκεί για την
#     αγορά ενός κράνους αξίας 50 ευρώ.                                                                                  Μονάδες 5  


count = 0
count20 = 0
sum = 0
while sum < 1200:
    count = count + 1
    print "Type the tip of the ", count, "th day: "
    tip = input()
    if tip > 20:
        count20 = count20 + 1
    sum = sum + tip
print "It takes ", count, " days to collect 1200 euros"
rate = float(count20) / count * 100
print "The percentage of days when the tip was greater than 20 euros is ", rate, "%"
change = sum - 1200
if change > 0:
    print "Surplus: ", change, "euros"
    if change > 50:
        print "The surplus is enough to buy a helmet of 50 euros"
